# FbxLightLimunousIntensity Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FbxLightLimunousIntensity Property
ParameterTypeId Class See Also
---
"Luminous Intensity"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FbxLightLimunousIntensity { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FbxLightLimunousIntensity As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FbxLightLimunousIntensity {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace